'use strict'
//!  ПРАКТИКА НА ПЕРВЫЙ ПАРАГРАФ
//? Код должен находить сумму чисел:
// let num1 = 1;
// let num2 = 2;
// console.log('сумма: ' + (num1 + num2)); // Нужно использовать группируюшие скобки


//? Код должен находить сумму чисел:
// let a = 1;
// let b = 2;
// console.log(a + b);

//?  Код должен находить сумму цифр числа:

// let num = '123';
// let sum = +num[0] + +num[1] + +num[2];
// console.log(sum); // Нужно преобразовать к числу

//? Код должен вывести первую цифру числа:

// let num = 123;
// let num2 = String(num);// Преобразавать сначала к строке
// console.log(num2[0]);

// ? Код должен был вывести в консоль число 1, но выводит 0:

// let a = 0;
// console.log(++a); // Поставить префекснкю форму

//? Код должен вывести количество цифр в числе:

// let num = 123;
// let str = String(num); // Преобразовать сначало к строке
// console.log(str.length);

// ? Код должен найти количество секунд в сутках:

// let a = 60 * 60 * 24;
// console.log(a);

//? Код должен вывести последнюю цифру числа:

// let num = 123;
// let str = String(num);
// console.log(str[str.length -1]);

//? Код должен вывести количество цифр в числе:

// let num = 123;
// let str = String(num);
// console.log(str.length);

//? Код должен вывести последнюю цифру числа:

// let num = 123;
// let str = String(num);
// console.log(str[str.length -1]);

//? Код должен найти сумму чисел:

// let a = '123';
// let b = '456';
// let s = Number(a) + Number(b);
// console.log(s);

//? од должен найти сумму чисел:

// let aaa = 1;
// let bbb = 2;
// let ccc = 3;
// console.log(aaa + bbb + ccc);

//!  Практика на операции в JavaScript

// ? Найдите количество секунд в сутках.

// let second = 60 * 60 * 24;
// console.log(second);

// ? Найдите количество секунд в 30 сутках.

// let second = 60 * 60 * (24 * 30);
// console.log(second);

// ? Найдите количество секунд в году.

// let second = 60 * 60 * (24 * 365);
// console.log(second);

// ? Найдите количество минут в сутках.

// let second = 60 * 24;
// console.log(second);

// ? Найдите количество минут в году.

// let second = 60 * (24 * 360);
// console.log(second);


//! Практика на формулы в JavaScript

// * Пусть дана переменная r с радиусом круга.
// * По соответствующей формуле найдите площадь круга и запишите ее в переменную s.
// * Выведите содержимое этой переменной на экран.

// const P = 3.14
// let R = 20;
// let S = P * R * R;
// console.log(S);

// * Пусть дана переменная a со стороной квадрата.
// * Найдите площадь квадрата и запишите ее в переменную s.
// * Выведите содержимое этой переменной на экран. S = a * a = b(2)
//
// let a = 4;
// let S = a * a ;
// console.log(S)






























