'use strict'

// ? В переменной day лежит какое-то число из интервала от 1 до 31.
// ? Определите в какую декаду месяца попадает это число
// ? (в первую, вторую или третью).// let day = 222;

// if (day >= 0 && day <= 10){
//     console.log('Первая четверть месяца');
// } else if (day >= 11 && day <= 20){
//     console.log('Вторая половина месяца')
// } else if (day >= 21 && day <= 30){
//     console.log('Третья половина месяца')
// } else {
//     console.log('Неверный день')
// }

// ? Пусть в переменной num хранится число.
// ? Если это число попадает в диапазон от 10 до 99,
// ? то найдите сумму цифр этого числа.
// ? Если полученная сумма меньше или равна 9, то выведите сообщение о том,
// ? что сумма цифр однозначна, в противном случае выведите сообщение о том,
// ? что сумма цифр двухзначна.

// let num = 100;
// let sum = 0;
// if (num >= 10 && num <= 99) {
//     let str = String(num);
//     sum = +str[0] + +str[1];
//     if (sum <= 9) {
//         console.log('сумма цифр однозначна')
//     } else {
//         console.log('что сумма цифр двухзначна')
//     }
// } else {
//     console.log('Число не попадает в диапазон от 10 до 99')
// }





